#字符串str的操作
# 4.1序列（字符串 列表 元组）的通用操作
# 1.索引：表示单个数据
# 左右---索引从0开始
# 右左---索引从-1开始
# s='hello'
# h e l
# printf(s[0],s[1],s[3])
# printf(s[-5],s[-4],s[-3]
# 2.分片：表示取一部分的数据)
# s='absdefg'
# abc
# print(s[0:3:1])
# print(s[;3])
# aceg
# print(s[::2])
# 反向输出
#  print(s[::-1])
# 3.+-----连接序列 *int---复制序列
# print('hello'+''+'world')
# print('hello'*6)
# 4.序列常用函数
# len(变量）---计算序列的长度
# len(变量)---计算序列的最大值
# min(变量)---计算序列的最小值
# s='doctor'
# print(len(s),max(s),min(s)))
# 4.2字符串的格式化操作
# print('a=',199)
#1.使用format()方法格式化字符
# 格式：'格式控制字符串（）'.format(逗号分割的多个参数)
# print('{}您好，您本月的工资为{}元。'.format('张宇涵','37800'))
# {:请填充对齐方式(<>^)宽度精度（.2）类型（d f s）
# 精度：.2-小数小数点后保留两位有效数字，字符串从左到右输出两个字符
# a=123
# b=3.1415
# s='teacher'
# print('a={:#<},a{:*^10}'.format(a,a))
# print('b的值是:{:@<5.1f},b={:#>10.3f}'.format(b,b))
# print('s={:%<10s},s={:*>6.3s}'.format(s,s))
# a=$$$$123 b=3.14&&&& s=teach##
# print('a={:$>7d},a={:*^10d}'.formata,(a,a))
# 文本进度条
#%[->................]
#10[*->..............]
#20[****->...........]
#30[******->.........]
#
#
#
# ...
# print('%{}[{}->{}]'.format(a,b,c))
# 11行：0--10行 range(0,11)----i
#0,10,20,30...100----i/10*100
# ...:20 18 16....0'..'
# ..20 18 16...0'..'

# import time
# print('-'*15+'执行开始'+'-'*15）
#  time.sleep(1)
# for i in range(0,11):
#     a=i/10*100
#     b='**'*i
#     c='..'*(10-i)
#     print('%{:^3.0f}[{}->[]]'.format(a,b,c))
#     time.sleep(0.5)
# print('-'*15+'执行结束'+'-'*15)
